In [1]:
import pandas as pd

In [2]:
data1=['Sachin','Dhoni','Kohli']

In [14]:
df1=pd.DataFrame(data1)

In [15]:
print(df1)

        0
0  Sachin
1   Dhoni
2   Kohli

In [8]:
data2=[['Sachin',20000],['Dhoni',15000],['Kohli',8000]]

In [9]:
print(data2)

[['Sachin', 20000], ['Dhoni', 15000], ['Kohli', 8000]]

In [12]:
df2=pd.DataFrame(data2, columns=['Name','Runs'])

In [13]:
df2

     Name   Runs
0  Sachin  20000
1   Dhoni  15000
2   Kohli   8000

In [16]:
data3=('Sachin','Dhoni','Kohli')

In [17]:
df3=pd.DataFrame(data3)

In [18]:
df3

        0
0  Sachin
1   Dhoni
2   Kohli

In [19]:
data4=(('Sachin',20000),('Dhoni',10000),('Kohli',8000))

In [23]:
df4=pd.DataFrame(data4,columns=['Name','Runs'])

In [24]:
df4

     Name   Runs
0  Sachin  20000
1   Dhoni  10000
2   Kohli   8000

In [25]:
data5={'Sachin','Dhoni'}

In [27]:
df5=pd.DataFrame(data5)

In [28]:
df5

        0
0  Sachin
1   Dhoni

In [56]:
data6=[{"name":"Sachin","runs":20000},{"name":"Dhoni","runs":15000}]

In [57]:
df6=pd.DataFrame(data6, index=["p1","p2"])

In [58]:
df6

      name   runs
p1  Sachin  20000
p2   Dhoni  15000